use pyo3::prelude::*;
use pyo3::types::PyModule;
use pyo3::{pymodule, PyResult, Python};
use serde::{Deserialize, Serialize};
use std::collections::HashMap;
use std::{
    fs::{File, OpenOptions},
    io::{Read, Write},
};
use unicode_segmentation::UnicodeSegmentation;

type LookUp = HashMap<u16, Vec<u8>>;
type Pair = (u16, u16);
type Merges = HashMap<Pair, u16>;
type PairCounter = HashMap<Pair, u32>;
type CharsLookup = HashMap<String, u16>;

#[derive(Serialize, Deserialize, Debug, PartialEq, Eq)]
#[pyclass]
pub struct Data {
    lookup: LookUp,
    merges: Merges,
    unicode_lookup: CharsLookup,
}

impl Data {
    pub fn new() -> Data {
        Data {
            lookup: HashMap::new(),
            merges: HashMap::new(),
            unicode_lookup: HashMap::new(),
        }
    }
    pub fn from(lookup: HashMap<u16, Vec<u8>>, merges: Merges) -> Data {
        Data {
            lookup: lookup,
            merges: merges,
            unicode_lookup: HashMap::new(),
            // bytes_lookup: HashMap::new(),
        }
    }
    fn _train(&mut self, train_file: String, print_logs: bool, logs_file: String) {
        self.unicode_lookup.insert("oov".to_owned(), 0);
        self.lookup.insert(0, [].to_vec());
        let mut log_file: File = File::create(logs_file.clone()).expect("To Work");
        if print_logs {
            log_file = OpenOptions::new()
                .write(true)
                .create(true)
                .truncate(true)
                .open(logs_file)
                .expect("Logs File throws an error To Work");
            log_file
                .write("Started \n ".as_bytes())
                .expect("Logs File throws an error To Work");
            log_file = OpenOptions::new()
                .append(true)
                .create(true)
                .open("log.txt")
                .expect("To Work");
        }
        // for i in 0..256 {
        //     self.lookup.entry(i).or_insert([i as u8].to_vec());
        // }
        let mut file = File::open(train_file).expect("Train File Not Existed");
        let mut buffer: [u8; 3067833] = [0; 1073741824 / 350];
        let mut time = 0;
        println!("Just Started");
        loop {
            time += 1;
            let count = file.read(&mut buffer).expect("To Work");
            if count == 0 {
                break;
            }
            let st = String::from_utf8_lossy(&buffer);
            let st = st.replace("<|im_start|>", "^");
            let st = st.replace("<|im_end|>", "^");
            let mut compress_buffer: Vec<u16> = Vec::new();
            for grapheme in st.graphemes(true) {
                let is_available = self.unicode_lookup.contains_key(&grapheme.to_owned());
                if !is_available {
                    let token = self.lookup.len().clone() as u16;
                    self.unicode_lookup.insert(grapheme.to_owned(), token);
                    self.lookup.insert(token, grapheme.as_bytes().to_vec());
                }
                let v = self.unicode_lookup.get(grapheme).unwrap();
                compress_buffer.push(*v);
            }
            let mut new_bytes: Vec<u16>;
            if time == 1 {
                new_bytes = compress_buffer;
            } else {
                new_bytes = encode_bytes(&compress_buffer.clone(), &self.merges);
            }
            println!("Finish converting new read chunk to tokens");
            for c in 0..700 {
                let counter = count_occur(&new_bytes);
                let (max, how_much) = find_max(&counter);
                if how_much < 10 {
                    continue;
                };
                if let Some(c) = self.merges.get(&max) {
                    println!("No News Loop count is {:?}", c);
                    new_bytes = replace_occur(max, &new_bytes, *c);
                } else {
                    let new_token = self.lookup.keys().len() as u16;
                    self.merges.insert(max, new_token);
                    let mut new_value = Vec::new();

                    match self.lookup.get(&max.0) {
                        Some(v) => new_value.extend(v),
                        None => panic!("This should not happen"),
                    }
                    match self.lookup.get(&max.1) {
                        Some(v) => new_value.extend(v),
                        None => panic!("This should not happen"),
                    }
                    self.lookup.insert(new_token, new_value);

                    if print_logs {
                        log_file
                            .write_all(
                                format!(
                                    "Token {:?} | Merge {:?} | {:?} Times | Loop {:?}\n",
                                    new_token, max, how_much, c
                                )
                                .as_bytes(),
                            )
                            .expect("To Work");
                    }
                    new_bytes = replace_occur(max, &new_bytes, new_token);
                    println!(
                        "Token {:?} | Merge {:?} | {:?} Times | Loop {:?}",
                        new_token, max, how_much, c
                    );
                }
            }
            save_to_file(&self, "tokenizer");
            log_file
                .write_all("\n-----------------------------------------------------------------------------------\n" .as_bytes())   
                .expect("To Work")
        }
    }

    fn _encode(&self, st: String) -> Vec<u16> {
        let mut bytes: Vec<u16> = Vec::new();
        for grapheme in st.graphemes(true) {
            let is_available = self.unicode_lookup.contains_key(&grapheme.to_owned());
            if !is_available {
                bytes.push(*self.unicode_lookup.get("oov").unwrap());
            } else {
                let v = self.unicode_lookup.get(grapheme).unwrap();
                bytes.push(*v);
            }
        }
        let mut counter = count_occur(&bytes);
        let mut max = find_max(&counter).0;
        while let Some(merge) = self.merges.get(&max) {
            bytes = replace_occur(max, &bytes, *merge);
            counter = count_occur(&bytes);
            max = find_max(&counter).0;
        }
        return bytes;
    }

    fn _decode(&self, tokens: Vec<u16>) -> String {
        let mut bytes: Vec<u8> = Vec::new();
        for token in tokens {
            match self.lookup.get(&token) {
                Some(v) => bytes.extend(v),
                None => panic!("This should not happend"),
            }
        }
        return String::from_utf8_lossy(&bytes).to_string();
    }
}

#[pymethods]
impl Data {
    pub fn train(&mut self, train_file: String, print_logs: bool, logs_file: String) {
        self._train(train_file, print_logs, logs_file)
    }

    pub fn encode(&self, st: String) -> Vec<u16> {
        return self._encode(st);
    }

    pub fn decode(&self, tokens: Vec<u16>) -> String {
        return self._decode(tokens);
    }

    pub fn vocab(&self) -> Vec<u16> {
        let v: Vec<u16> = self.lookup.keys().cloned().collect();
        return v;
    }
}

fn encode_bytes(bytes: &[u16], merges: &Merges) -> Vec<u16> {
    let mut bytes: Vec<u16> = bytes.to_vec();
    let mut ignores = Vec::new();
    let mut failed_count = 0;
    while failed_count < 7 {
        let counter = count_occur(&bytes);
        let max = find_max_and_ignore(&counter, &ignores).0;
        let v = merges.get(&max);
        if v.is_none() {
            ignores.push(max);
            failed_count += 1;
            println!("Failed to find a match between the max occur with already learned | Failed Count {failed_count}");
            continue;
        }
        failed_count = 0;
        let merge = v.unwrap();
        bytes = replace_occur(max, &bytes, *merge);
        println!(
            "Found a match between the max occur with already learned | Pair is {:?}",
            max
        );
    }
    return bytes;
}

fn count_occur(bytes: &[u16]) -> PairCounter {
    let mut counter: PairCounter = HashMap::new();
    for (i, b) in bytes.iter().enumerate() {
        if i == bytes.len() - 1 {
            continue;
        }
        let pair = (*b as u16, bytes[i + 1] as u16);
        *(counter.entry(pair).or_insert(0)) += 1;
    }
    return counter;
}

fn find_max(counter: &PairCounter) -> (Pair, u32) {
    if counter.len() == 0 {
        panic!("Counter should not be zero");
    }

    let first = counter.iter().next().expect("msg");
    let mut max_pair = first.0;
    let mut max_value = first.1;
    for (pair, count) in counter {
        if count > max_value {
            max_pair = pair;
            max_value = count;
        }
    }

    return (*max_pair, *max_value);
}

fn find_max_and_ignore(counter: &PairCounter, ignore: &Vec<Pair>) -> (Pair, u32) {
    if counter.len() == 0 {
        panic!("Counter should not be zero");
    }

    let first = counter
        .iter()
        .skip_while(|v| ignore.contains(&(v.0)))
        .next()
        .expect("msg");
    let mut max_pair = first.0;
    let mut max_value = first.1;
    for (pair, count) in counter {
        if ignore.contains(&pair) {
            continue;
        }
        if count > max_value {
            max_pair = pair;
            max_value = count;
        }
    }

    return (*max_pair, *max_value);
}

fn replace_occur(occur: Pair, bytes: &[u16], with: u16) -> Vec<u16> {
    let mut new_bytes: Vec<u16> = Vec::new();
    let mut i = 0;
    while i < bytes.len() {
        if i < bytes.len() - 1 && bytes[i] as u16 == occur.0 && bytes[i + 1] as u16 == occur.1 {
            new_bytes.push(with);
            i += 2;
        } else {
            new_bytes.push(bytes[i] as u16);
            i += 1
        }
    }
    return new_bytes;
}

fn save_to_file(data: &Data, filename: &str) {
    let encoded: Vec<u8> = bincode::serialize(data).expect("Should work");
    let mut file = File::create(filename).expect("Should work");
    file.write_all(&encoded).expect("Should work");
    println!("--------------------------------------------- \n Saved Successfully \n---------------------------------------------");
}

#[pyfunction]
pub fn load_from_file(filename: &str) -> Data {
    let mut file = File::open(filename).expect("Should work");
    let mut encoded = Vec::new();
    file.read_to_end(&mut encoded).expect("Should work");
    let data: Data = bincode::deserialize(&encoded).expect("Should work");
    return data;
}

#[cfg(test)]
mod tests {

    use crate::load_from_file;

    // #[test]
    // fn test_encode() {
    //     let data = load_from_file("tokenizer");
    //     let mut buf = [0; 1073741824 / 150];
    //     File::open("arabic_dataset.txt")
    //         .expect("Shoud lbe there")
    //         .read(&mut buf)
    //         .expect("msg");
    //     let tokens = data._encode(String::from_utf8_lossy(&buf).to_string());
    //     let res = data._decode(tokens);
    //     println!("Decoded Result = {:?}", res);
    // }

    fn test_hi() {
        println!("Hi");
    }

    #[test]
    fn test_encode() {
        let str = "المركز الدولي لتسوية المنازعات الاستشارية (منذ 20 يناير 2011) مؤسسة التمويل الدولية (منذ 11 أكتوبر 2008) وكالة ضمان الاستثمار متعدد الأطراف (منذ 22 أكتوبر 1996) الاتحاد الدولي للاتصالات (منذ 27 مارس 1973)[6] البنك الدولي للإنشاء والتعمير (منذ 25 سبتمبر 1972)يونسكو (منذ 27 يناير 1972)[7] الأمم المتحدة (منذ 21 سبتمبر 1971) جامعة الدول العربية (منذ 11 سبتمبر 1971) منظمة التجارة العالمية منظمة حظر الأسلحة الكيميائية[8] المنظمة الهيدروغرافية الدولية[9] منظمة التعاون الإسلامي منظمة الشرطة الجنائية الدولية[10] الصندوق العربي للإنماء الاقتصادي والاجتماعي صندوق النقد العربي الاتحاد البريدي العالمي[11] المصرف العربي للتنمية الاقتصادية في أفريقيا الناتج المحلي الإجمالي سنة التقدير	2022  ← الإجمالي	$303.596 مليار▲[12] (62 ← الإجمالي عند تعادل القوة الشرائية	339,525,944,602 جيري / خميس دولار (2017)[13] ← للفرد	$113.038▲[12] الناتج المحلي الإجمالي الاسمي سنة التقدير	2022 ← الإجمالي	$179 مليار▲[14] (55) ← للفرد	$82,877▲[12] (5) معدل نمو الناتج المحلي الإجمالي الحقيقي	2.7 نسبة مئوية (2016)[15] إجمالي الاحتياطي	15,007,730,964 دولار أمريكي (2017)[16] مؤشر التنمية البشرية السنة	2016 المؤشر	 0.856[17] التصنيف	عالية جداً (33) متوسط الدخل	 26555 دولار أمريكي  تعديل قيمة خاصية (P3529) في ويكي بيانات السن القانونية	18 سنة  تعديل قيمة خاصية (P2997) في ويكي بيانات بيانات أخرى العملة	ريال قطري QAR البنك المركزي	مصرف قطر المركزي  تعديل قيمة خاصية (P1304) في ويكي بيانات رقم هاتف الطوارئ	 999  [لغات أخرى]‏ 112 (خدمات طبية طارئة، ‏شرطة و الحماية المدنية)[18]  تعديل قيمة خاصية (P2852) في ويكي بيانات المنطقة الزمنية	ت ع م+03:00  تعديل قيمة خاصية (P421) في ويكي بيانات ← في الصيف (DST)	+3 المنطقة الزمنية	توقيت عربي قياسي جهة السير	اليمين رمز الإنترنت	.qa أرقام التعريف البحرية	466  تعديل قيمة خاصية (P2979) في ويكي بيانات الموقع الرسمي	الموقع الرسمي  تعديل قيمة خاصية (P856) في ويكي بيانات أيزو 3166-1 حرفي-2	QA  تعديل قيمة خاصية (P297) في ويكي بيانات رمز الهاتف الدولي	974+ وسيط property غير متوفر. تعديل مصدري - تعديل  طالع توثيق القالب قَطَرْ أو (رسمياً: دَوْلَةُ قَطَرْ)، هي دولة عربية خليجية تقع في شرق شبه الجزيرة العربية في جنوب غرب آسيا مطلّة على الخليج العربي وعاصمتها الدوحة. لها حدود برية مشتركة من الجنوب مع المملكة العربية السعودية وبحرية مع دولة الإمارات العربية المتحدة، مملكة البحرين. وفي أعقاب الحكم العثماني، أصبحت قطر محمية بريطانية في أوائل القرن العشرين حتى حصولها على الاستقلال في عام 1971م. وقد حكمت قطر أسرة آل ثاني منذ منتصف القرن التاسع عشر بعد فترة قصيرة من قدومها من محافظة أشيقر في نجد.[19] نظام الحكم في قطر إمارة وراثية دستورية، وحاكم الدولة هو الأمير تميم بن حمد بن خليفة آل ثاني. وافق الشعب على الدستور بأغلبية ساحقة في استفتاء دستوري، بنسبة 98٪ تقريباً لصالح المشروع. وكان مجموع السكان في قطر في عام 2022 م، 2,980,338 نسمة: يبلغ عدد المواطنين القطريين داخل حدود قطر 380,000 والمقيمين 2,600,338 تعد دولة قطر هي المجتمع الأكثر محافظة بعد المملكة العربية السعودية في دول مجلس التعاون الخليجي.  كما أن قطر من الدول مرتفعة الدخل وكانت الدولة هي الأعلي دخلًا بين الدول العربية والخامسة عالميًا لعام 2023،[20][21] تتمتع قطر بثروات طبيعية هائلة مع عدد سكان قليل للغاية؛ حيث لديها ثالث أكبر إحتياطيات العالم من الغاز الطبيعي[22] وهي أكبر دولة مصدرة للغاز المسال في العالم،[23] وتمتلك ثالث عشر أكبر إحتياطي مؤكد من النفط.[24] وتصنف الأمم المتحدة قطر دولة ذات تنمية بشرية عالية جداً إذ أنها أحد الدول العربية الأكثر تقدماً في مجال التنمية البشرية. وتُصنّف قطر الدولة ذات أعلى دخل للفرد في العالم. تعد قطر لاعباً رئيسياً مؤثراً في منطقة الشرق الأوسط. أستضافت قطر كأس العالم لكرة القدم 2022،[25] وأصبحت أول دولة عربية تقوم بذلك. برزت قطر كقوة متوسطة في العالم العربي من خلال ثرواتها من المواد بالإضافة إلي مجموعتها الإعلامية المتوسعة عالميًا،[26] وبحسب ما ورد دعمت العديد من الجماعات المتمردة مالياً خلال الربيع العربي.[27] اعتبر الأكاديميون والمنظمات غير الحكومية أن سجل قطر في مجال حقوق الإنسان فقير بشكل عام، مع قيود على الحريات المدنية مثل حرية تكوين الجمعيات والتعبير والصحافة، فضلًا عن معاملتها لآلاف العمال المهاجرين التي ترقى إلى مصاف العمل القسري لمشاريع في البلاد. مُنحت بطولة كأس العالم لكرة القدم 2022 لقطر في ظل ظروف مثيرة للجدل، مما يجعلها أول دولة إسلامية في العالم العربي تستضيف الحدث.[28] استضافت قطر دورة الألعاب الآسيوية لعام 2006، وستستضيف أيضًا دورة الألعاب الآسيوية لعام 2030.[29] مدينة الدوحة قديماً ، 1904م التسمية اسم قطر قد جاء في الخرائط لأول مرة على الخارطة التي رسمها الروماني بطليموس للميلاد. حيث أن هناك عدة دلائل وقرائن تدل على ذلك من بينها، إن الاسم الوارد في خارطة الجغرافي الروماني بطليموس ينص على لفظين لشبه جزيرة قطر كتبا بالأحرف اللاتينية بشكل (Catara) (قطارا) أو (كتارا) أو بهيئة (Cadara) (كدارا) أن هاتين الصيغتين أقرب ما تكونان إلى لفظة اسم قطر الحالية. التاريخ المقالة الرئيسة: تاريخ قطر جزء من سلسلة حول تاريخ قطر Emblem of Qatar ما قبل التاريخ العصر القديم العصر الذهبي الإسلامي ما بعد الإسلام والتدخل الأوروبي الحقبة المعاصرة والاستقلال علم الآثار الأمراء عنت العصور القديمة يعود تاريخ الاستيطان البشري في شبه الجزيرة القطرية إلى 10,000 سنة مضت. تم اكتشاف المستوطنات والأدوات التي تعود إلى العصر الحجري في شبه الجزيرة.[30] في القرن الخامس قبل الميلاد أشار المؤرخ اليوناني هيرودوس إلى قطر. كما أن عالم الجغرافيا بطليموس ضمن خريطته «خريطة العالم العربي» ما أسماه «قطارا» وهي ما يعتقد أنها إشارة إلى بلدة «الزبارة» القطرية التي اكتسبت شهرتها كأحد أهم الموانئ التجارية في منطقة الخليج العربي في ذلك الوقت. تم اكتشاف القطع الأثرية في بلاد ما بين النهرين التي نشأت في فترة العبيد (6,500-3,800 قبل الميلاد) في المستوطنات الساحلية المهجورة.[31] تعد الدعسة وهي مستوطنة تقع على الساحل الغربي لقطر أهم موقع للعبيد في البلاد ويعتقد أنها استوعبت مخيمًا موسميًا صغيرًا.[32][33] مادة الكيشيون البابلية التي تعود إلى الألفية الثانية قبل الميلاد والتي وجدت في جزر الخور تشهد على العلاقات التجارية بين سكان قطر والكيشيون في بلاد البحرين الحديثة.[34] من بين النتائج كانت 3,000,000 قذيفة حلزونية مسحوقة وكسرة من إناء خزفي يعود للكيشيون. قطر هي أقرب موقع معروف لإنتاج الصبغيات المحارية وذلك بسبب صناعة كايت الأرجوانية الصبغة التي كانت موجودة على الساحل.[35] في عام 224 م سيطرت الإمبراطورية الساسانية على الأراضي المحيطة بالخليج العربي.[36] لعبت قطر دورًا في النشاط التجاري للساسانيين وأسهمت في سلسلتين على الأقل: اللآلئ الثمينة والصبغ الأرجواني.[37] في العهد الساساني أُدخِل العديد من سكان شرق شبه الجزيرة العربية في المسيحية بعد تشتت مسيحيو بلاد ما بين النهرين.[38] شيدت الأديرة وتم تأسيس مزيد من المستوطنات خلال هذه الحقبة.[39][40] خلال الجزء الأخير من العصر المسيحي كانت قطر تضم منطقة تعرف باسم بيت القطريين.[41] لم تقتصر المنطقة على قطر بل شملت البحرين وجزيرة تاروت والخات والأحساء.[42] في عام 628 م أرسل النبي محمد صلى الله عليه وسلم مبعوثًا إسلاميًا إلى حاكم شرق شبه الجزيرة العربية المنذر بن ساوى يطلب منه ومن رعاياه الدخول في الإسلام. وافق المنذر على طلبه وبناء على ذلك تحولت معظم القبائل العربية في المنطقة إلى الإسلام.[43] بعد اعتناق الإسلام قاد العرب الفتح الإسلامي لفارس الذي أدى إلى سقوط الإمبراطورية الساسانية.[44] الفترة الإسلامية المبكرة والمتأخرة (661-1783) المنحوتات في جبل الجساسية، الدوحة، يرجع تاريخها إلى 4000 ق.م وصفت قطر بأنها مركز شهير للخيول وتربية الإبل خلال الفترة الأموية.[45] في القرن الثامن بدأت تستفيد من موقعها الاستراتيجي التجاري في الخليج العربي وأصبحت مركزا لتجارة اللؤلؤ.[46][47] في فترة الفتن المتلاحقة من العصر العباسي، كانت قطر بين بلدان الساحل العربي على الخليج العربي التي ترعرع فيها الزنج وراجت دعوتهم ثم القرامطة حتى تلاشى أمرهم في القرن السابع للهجرة. كما حدث تطور كبير في صناعة اللؤلؤ في شبه الجزيرة العربية خلال العصر العباسي. رست السفن التي تبحر من البصرة إلى الهند والصين في موانئ قطر خلال هذه الفترة. الخزف الصيني والنقود والقطع الأثرية في غرب أفريقيا من تايلاند تم اكتشافها في قطر. تشير البقايا الأثرية من القرن التاسع إلى أن سكان قطر استخدموا ثروة أكبر لبناء منازل عالية الجودة ومباني عامة. تم بناء أكثر من 100 منزل من الحجر ومسجدين وحصن عباسي في مروب خلال هذه الفترة.[48][49] ومع ذلك عندما انخفض ازدهار الخلافة في العراق كذلك حدث ذلك في قطر.[50] يشار إلى قطر في الكتاب المسلم الذي صدر في القرن الثالث عشر لياقوت الحموي معجم البلدان والذي يلمح إلى عباءة القطريين المنسوجة بشكل جيد ومهاراتهم في تحسين وإنهاء الرماح.[51] تمت السيطرة على جزء كبير من شرق شبه الجزيرة العربية من قبل الدولة العصفورية في عام 1253م ولكن تم الاستيلاء على المنطقة من قبل أمير مملكة هرمز في عام 1320م.[52] كانت اللؤلؤة القطرية توفر للمملكة أحد مصادر دخلها الرئيسية.[53] في القرن الثامن الهجري استولى أسرة بني نبهان العمانيين على قطر. لم يطل مقامهم بها وتناوب عليها بعدهم كثير من البحرينيين. في عام 1515م قام مانويل الأول ملك البرتغال بتأييد مملكة هرمز. استولت البرتغال على جزء كبير من شرق شبه الجزيرة العربية في 1521م.[53][54] في عام 1537 أرسل السلطان العثماني سليمان القانوني أسطولاً بقيادة سليمان باشا والي مصر لطرد البرتغاليين وتمكن هذا الأسطول من القضاء على البرتغاليين وطردهم من هذه البلاد واستولى على البحرين والقطيف وقطر. في عام 1550م قدم سكان الأحساء طوعًا إلى حكم العثمانيين وفضلوهم عن البرتغاليين.[55] بعد الإبقاء على وجود عسكري ضئيل في المنطقة طرد العثمانيون من قبل قبيلة بني خالد في 1670م.[56] الحكم البحريني والسعودي (1783-1868) خريطة شرق الجزيرة العربية في 1794. جزء مستعاد جزئيا من بلدة الزبارة المدمرة. في عام 1766 هاجرت قبيلة العتوب آل خليفة من الكويت إلى الزبارة في قطر.[57][58] بحلول وقت وصولهم كان بنو خالد يمارسون سلطة ضعيفة على شبه الجزيرة وليس حجبا أن أكبر قرية كان يحكمها فرد من بني خالد.[59] في عام 1783م غزت عشائر العتوب والقبائل العربية المتحالفة ومقرها قطر البحرين وضمتها من الفرس. فرض آل خليفة سلطتهم على البحرين ووسعوا نطاق سلطتهم إلى كامل قطر. بعد تعيين سعود الكبير بن عبد العزيز بن محمد آل سعود وليًا للعهد في الدولة السعودية الأولى عام 1788م فقد انتقل إلى توسيع دولته شرقًا نحو الخليج العربي وقطر. بعد هزيمة بني خالد في عام 1795م تعرضت الدولة السعودية لهجوم على جبهتين. العثمانيون والمصريون اعتدوا على الجبهة الغربية في حين أن آل خليفة في البحرين والعمانيين شنوا هجومًا ضد الجبهة الشرقية.[60][61] بعد أن علم سعود الكبير بتطورات المصريين على الحدود الغربية في عام 1811م خفض حاميته في البحرين والزبارة من أجل إعادة وضع قواته. استفاد سعيد بن سلطان سلطان مسقط من هذه الفرصة وداهم الحاميات السعودية على الساحل الشرقي وأضرم النار في حصن الزبارة. عاد آل خليفة إلى السلطة بعد ذلك. كعقاب على القرصنة قصفت سفينة تابعة لشركة الهند الشرقية الدوحة في عام 1821م مما أدى إلى تدمير المدينة وإجبار مئات السكان على الفرار. في عام 1825م تم تأسس حكم عائلة آل ثاني من بني تميم بتعيين محمد بن ثاني آل ثاني أميرًا على قطر و ذلك بعد فترة من قدومهم من نجد.[62][63] على الرغم من أن دولة قطر كانت تتمتع بالوضع القانوني للتبعية إلا أن هناك شعور شعبي بالاستياء من آل خليفة. في عام 1867م أرسل آل خليفة مع حاكم أبوظبي قوة بحرية ضخمة إلى الوكرة في محاولة لسحق المتمردين القطريين. أدى ذلك إلى الحرب القطرية البحرينية البحرية من 1867 إلى 1868م حيث قامت قوات البحرين وأبو ظبي بسرقة ونهب الدوحة والوكرة.[64] ومع ذلك فإن الأعمال العدائية البحرينية تنتهك المعاهدة العامة للسلام 1820. أدى التوغل المشترك بالإضافة إلى الهجوم المضاد القطري إلى أن يقوم الوكيل السياسي البريطاني لويس بيلي بفرض تسوية في عام 1868م. كانت مهمته في البحرين وقطر التي نتجت عنه معاهدة السلام أهم حدث لأنه تم الاعتراف ضمنا بانفصال قطر عن البحرين والاعتراف صراحة بحكم محمد بن ثاني. بالإضافة إلى إخضاع البحرين لرفضها الاتفاق طلبت المحمية البريطانية التفاوض مع ممثل من قطر وهو الدور الذي تم من خلاله اختيار محمد بن ثاني للوفاء به. نتجت المفاوضات عن تعريف هوية سياسية للوطن الوليد على الرغم من أنه لم يحصل على مكانة رسمية كمحمية حتى عام 1916م. الحكم العثماني (1871-1915) قطر حسب خريطة أدولف تسيلر عام 1891. مدينة الدوحة القديمة، يناير 1904 تحت ضغوط عسكرية وسياسية من حاكم ولاية بغداد العثمانية مدحت باشا وافقت عائلة آل ثاني الحاكمة على الخضوع للحكم العثماني في عام 1871م.[65] فرضت الحكومة العثمانية إجراءات الإصلاح (التنظيمات العثمانية) المتعلقة بالضرائب وتسجيل الأراضي لإدماج هذه المناطق بالكامل في الإمبراطورية. على الرغم من رفض القبائل المحلية واصل آل ثاني دعم الحكم العثماني. ومع ذلك سرعان ما ركدت العلاقات القطرية العثمانية وفي عام 1882م عانوا من مزيد من النكسات عندما رفض العثمانيون مساعدة آل ثاني في حملتهم لتحرير الخور التي تحتلها أبوظبي. بالإضافة إلى ذلك دعم العثمانيون التابع العثماني محمد بن عبد الوهاب الذي حاول أن يحل محل آل ثاني كقائم مقام قطر في عام 1888م.[66] أدى ذلك في نهاية المطاف إلى ثورة آل ثاني ضد العثمانيين الذين يعتقد أنهم كانوا يسعون إلى السيطرة على شبه الجزيرة. استقال قائم مقام وتوقفوا عن دفع الضرائب في أغسطس 1892م.[67] في فبراير 1893م وصل محمد حافظ باشا إلى قطر في محاولة للحصول على ضرائب غير مدفوعة واعترض جاسم بن محمد على الإصلاحات الإدارية العثمانية المقترحة. خوفا من أنه سيواجه الموت أو السجن عاد جاسم إلى الوجبة (10 أميال غرب الدوحة) برفقة عدد من أفراد القبائل. طلب محمد أن يحل جاسم قواته ويتعهد بولاؤه للعثمانيين الذي قوبل بالرفض. في مارس سجن محمد شقيق جاسم و 13 من زعماء القبائل القطريين البارزين على الفرقيطة العثمانية المريخ كعقاب على عصيانهم. بعد أن رفض محمد عرضا لإطلاق سراح الأسرى مقابل رسوم قدرها 10,000 ليرة أمر بتكوين جيش من حوالي 200 جندي للتقدم نحو قلعة الوجبة التابعة لجاسم تحت قيادة يوسف أفندي مما يشير إلى بداية معركة الوجبة. تعرضت قوات أفندي لإطلاق نار كثيف من قبل قوات كبيرة من المشاة والفرسان القطريين بعد وقت قصير من وصوله إلى الوجبة. انسحبوا إلى قلعة شباكا حيث أجبروا مرة أخرى على الانسحاب من عملية توغل قطرية. بعد انسحابهم إلى قلعة البدع حاصر جيش جاسم المتطور القلعة مما أدى إلى هزيمة العثمانيين والاتفاق على التخلي عن أسرهم مقابل المرور الآمن لفرسان محمد باشا إلى الهفوف عن طريق البر.[68] على الرغم من أن قطر لم تحصل على استقلال تام عن الإمبراطورية العثمانية إلا أن نتيجة المعركة فرضت معاهدة تشكل في وقت لاحق أساس دولة قطر الناشئة كدولة مستقلة داخل الإمبراطورية.[69] الحكم البريطاني (1916-1971) قلعة الزبارة التي بنيت حوالي سنة 1938. سقطت الإمبراطورية العثمانية في الفوضى بعد أن خسرت معارك على جبهات مختلفة في مسرح الشرق الأوسط للحرب العالمية الأولى. شاركت قطر في الثورة العربية الكبرى ضد العثمانيين. كانت الثورة ناجحة وانحسر الحكم العثماني في البلاد. اعترفت المملكة المتحدة والإمبراطورية العثمانية بعبد الله بن قاسم آل ثاني وحق خلفائه في الحكم على شبه الجزيرة بأكملها. تخلى العثمانيون عن جميع حقوقهم في قطر وبعد اندلاع الحرب العالمية الأولى وأجبرهم عبد الله بن قاسم آل ثاني (الذي كان مؤيدا لبريطانيا) على التخلي عن الدوحة في عام 1915.[70] نتيجة لتقسيم الدولة العثمانية أصبحت قطر محمية بريطانية في 3 نوفمبر 1916. في ذلك اليوم وقعت المملكة المتحدة معاهدة مع عبد الله بن قاسم آل ثاني لإدخال قطر في إطار نظامها المتصالح للإدارة. في حين وافق عبد الله على عدم الدخول في أي علاقات مع أي سلطة أخرى دون موافقة مسبقة من الحكومة البريطانية فإن البريطانيين يضمنون حماية قطر من جميع الاعتداءات عن طريق البحر. في 5 مايو 1935 وقع عبد الله على معاهدة أخرى مع الحكومة البريطانية التي منحت قطر الحماية ضد التهديدات الداخلية والخارجية. تم اكتشاف احتياطيات النفط لأول مرة في عام 1939. ومع ذلك تأخر الاستغلال بسبب الحرب العالمية الثانية. بدأ تأثير الإمبراطورية البريطانية يتناقص بعد الحرب العالمية الثانية وخاصة بعد استقلال الهند وباكستان في عام 1947. في الخمسينات بدأ النفط يحل محل صيد اللؤلؤ والسمك كمصدر رئيسي للدخل في قطر. بدأت عائدات النفط في تمويل وتوسيع وتحديث البنية التحتية في قطر. ازداد الضغط على الانسحاب البريطاني من الإمارات العربية المتحدة في الخليج العربي خلال الخمسينيات. عندما أعلنت بريطانيا رسميا في عام 1968 أنها ستفصل سياسيا عن الخليج العربي خلال ثلاث سنوات وانضمت قطر إلى البحرين وسبع من إمارات الساحل المتصالح في اتحاد. غير أن النزاعات الإقليمية أجبرت قطر على الابتعاد عنهم وإعلان الاستقلال عن التحالف الذي سيتحول في النهاية إلى دولة الإمارات العربية المتحدة. الاستقلال وبعده (1971 إلى الوقت الحاضر) سفينة داو التقليدية في الخليج الغربي لكورنيش الدوحة. دخلت دولة قطر في هدنة بحرية عامة مع المملكة المتحدة في عام 1968. أبرمت معاهدة عامة بين الاثنين في 3 نوفمبر 1916. كانت المعاهدة العامة تعهد بالسياسة الخارجية والدفاع إلى المملكة المتحدة ولكنها سمحت بالاستقلال الداخلي. في 3 سبتمبر 1971 أنهيت «الترتيبات التعاهدية الخاصة» التي «لا تتفق مع المسؤولية الدولية الكاملة كدولة مستقلة ذات سيادة».[71] تم ذلك بموجب اتفاق تم التوصل إليه بين حاكم قطر وحكومة المملكة المتحدة.[71][72] في عام 1991 لعبت قطر دورًا هامًا في حرب الخليج الثانية وخاصة خلال معركة الخفجي حيث دخلت الدبابات القطرية في شوارع البلدة وقدمت دعما للحرائق لوحدات الحرس الوطني السعودي التي كانت مشتبكة مع قوات الجيش العراقي. سمحت قطر لقوات التحالف من كندا باستخدام البلاد كقاعدة جوية لإنطلاق الطائرات في دوريات جوية قتالية كما سمحت للقوات الجوية من الولايات المتحدة وفرنسا بالعمل في أراضيها. في عام 1995 سيطر حمد بن خليفة آل ثاني على البلاد بعد عزل والده خليفة بن حمد آل ثاني بدعم من القوات المسلحة ومجلس الوزراء فضلاً عن الدول المجاورة[73] وفرنسا.[74] في ظل حمد شهدت قطر درجة معتدلة من التحرر بما في ذلك إطلاق قناة الجزيرة عام 1996 وتأييد حق النساء في التصويت في الانتخابات البلدية عام 1999 وصياغة دستورها المكتوب الأول عام 2005 وافتتاح كنيسة الروم الكاثوليك عام 2008. في عام 2010 فازت قطر بحق استضافة كأس العالم لكرة القدم 2022 مما يجعلها أول دولة في الشرق الأوسط يتم اختيارها لاستضافة البطولة. أعلن الأمير عن خطط قطر لإجراء أول انتخابات تشريعية وطنية في عام 2013. كان من المقرر عقدها في يونيو 2013 ولكن أُجِّلَت حتى عام 2019.في عام 2003 عملت قطر كمقر للقيادة المركزية الأمريكية وأحد مواقع الإطلاق الرئيسية لغزو العراق.[75] في مارس 2005 قتل تفجير انتحاري معلم بريطاني في مسرح لاعبي الدوحة مما أذهل البلاد التي لم تشهد من قبل أعمالًا إرهابية. التفجير نفذه عمر أحمد عبد الله علي وهو مواطن مصري في قطر كان يشتبه في ارتباطه بتنظيم القاعدة في جزيرة العرب.[76][77] في عام 2011 انضمت قطر إلى عمليات حلف شمال الأطلسي في ليبيا وقامت بتسليح جماعات المعارضة الليبية.[78] كما أنها حاليًا الممول الرئيسي لأسلحة الجماعات المتمردة في الحرب الأهلية السورية.[79] تسعى قطر إلى التوصل إلى اتفاق سلام أفغاني وفي يناير 2012 قالت حركة طالبان الأفغانية أنها تقوم بإنشاء مكتب سياسي في قطر لتسهيل المحادثات. تم ذلك من أجل تسهيل مفاوضات السلام وبدعم من بلدان أخرى بما فيها الولايات المتحدة وأفغانستان. قال أحمد رشيد في صحيفة فاينانشال تايمز أنه من خلال مكتب قطر سهلت الاجتماعات بين طالبان والعديد من الدول والمنظمات بما فيها وزارة الخارجية الأمريكية والأمم المتحدة واليابان والعديد من الحكومات الأوروبية والمنظمات غير الحكومية الذين كانوا يحاولون دفع فكرة محادثات السلام إلى الأمام. قال أن الاقتراحات التي قدمها رئيسا الولايات المتحدة وأفغانستان في سبتمبر 2017 أدت إلى احتجاجات من كبار المسؤولين في وزارة الخارجية الأمريكية.[80] في يونيو 2013 أصبح تميم بن حمد آل ثاني أميرًا على قطر بعد أن سلمه والده السلطة في خطاب تلفزيوني.[81] أعطى تميم الأولوية لتحسين الرفاه المحلي للمواطنين والذي يتضمن إنشاء أنظمة الرعاية الصحية والتعليم المتقدمة وتوسيع البنية التحتية للبلاد استعدادًا لاستضافة كأس العالم 2022.[82] شاركت قطر في التدخل العسكري في اليمن الذي تقوده السعودية ضد الحوثيين والقوات الموالية للرئيس السابق علي عبد الله صالح الذي أطيح به في انتفاضات الربيع العربي عام 2011.[83] في يونيو 2017 قطعت مصر والمملكة العربية السعودية والإمارات العربية المتحدة والبحرين العلاقات الدبلوماسية مع قطر مستشهدة بالدعم المزعوم الذي تقدمه البلاد للمجموعات التي تعتبرها متطرفة.[84] السياسة المقالة الرئيسة: سياسة قطر الديوان الأميري في الدوحة، قطر قطر هي إما ملكية دستورية أو ملكية مطلقة تحكمها عائلة آل ثاني.[85][86] كانت أسرة آل ثاني حاكمة في قطر منذ تأسيس السلالة في عام 1825. في عام 2003 اعتمدت قطر دستورا ينص على الانتخاب المباشر ل 30 عضوا من أعضاء المجلس التشريعي البالغ عددهم 45 عضوا.[87][88] أقر الدستور بأغلبية ساحقة في استفتاء مع ما يقرب من 98٪ لصالحه. أمير قطر الثامن هو تميم بن حمد آل ثاني الذي سلمه والده حمد بن خليفة آل ثاني السلطة في 25 يونيو 2013.[89] الأمير له السلطة الحصرية لتعيين وعزل رئيس الوزراء ووزراء مجلس الوزراء الذين يشكلون معا مجلس الوزراء الذي هو السلطة التنفيذية العليا في البلاد.[90] كما يقوم مجلس الوزراء بالتشريع. تحال القوانين والمراسيم التي يقترحها مجلس الوزراء إلى مجلس الشورى للمناقشة التي تقدم بعدها إلى الأمير للتصديق عليها. للمجلس الاستشاري سلطة تشريعية محدودة في صياغة القوانين والموافقة عليها إلا أن الأمير له القول النهائي في جميع المسائل. يتألف المجلس الحالي بالكامل من أعضاء يعينهم الأمير. لم تجر انتخابات تشريعية منذ عام 1970 عندما أجريت انتخابات جزئية. تم تأجيل الانتخابات التشريعية حتى عام 2019.[91] لا يسمح القانون القطري بإنشاء هيئات سياسية أو نقابات.[92] قانون الشريعة وفقا لدستور قطر فإن الشريعة الإسلامية هي المصدر الرئيسي للتشريع القطري.[93][94] على الرغم من أن النظام القانوني في قطر هو في الواقع مزيج من القانون المدني والقانون الشرعي.[95][96] يطبق القانون الشرعي على قانون الأسرة والميراث والعديد من الأعمال الإجرامية (بما في ذلك الزنا والسطو والقتل). في بعض الحالات تعامل محاكم الأسرة التي تتخذ من الشريعة الإسلامية شهادة المرأة بأنها تبلغ نصف شهادة الرجل. تم إدخال قانون الأسرة المقنن في عام 2006.[97] يسمح بتعدد الزوجات للمسلمين. العقوبة الجسدية القضائية شائعة في قطر، يتم استخدام الجلد كعقاب على شرب الكحول أو العلاقات الجنسية غير المشروعة. المادة 88 من القانون الجنائي القطري تعلن أن عقوبة الزنا 100 جلدة وفي عام 2006 تلقت امرأة فلبينية تلك العقوبة.[98] في عام 2010 حكم على ما لا يقل عن 18 شخصا (معظمهم من الأجانب) بتلقي ما بين 40 و 100 جلدة بسبب جرائم تنطوي على «علاقات جنسية غير مشروعة» أو شرب الكحول.[96] في عام 2011 حكم على ما لا يقل عن 21 شخصا (معظمهم من الأجانب) ما بين 30 و 100 جلدة لنفس الأسباب.[99] وفي عام 2012 حكم على ستة مغتربين إما 40 أو 100 جلدة.[100] المسلمون اللائقون طبيا هم وحدهم الذين يتعرضون لهذه الأحكام. من غير المعروف ما إذا كانت الأحكام قد نفذت.[101] في أبريل 2013 حكم على مغترب مسلم ب 40 جلدة لشرب الكحول،[102][103][104] وفي يونيو 2014 حكم على مغترب مسلم ب 40 جلدة لشرب الكحول والقيادة تحت تأثيره.[105] الرجم هو العقاب القانوني في قطر،[106] والردة والمثلية هي جرائم يعاقب عليها بعقوبة الإعدام.[107][108] يمكن أن يؤدي التجديف إلى السجن لمدة تصل إلى سبع سنوات في حين أن التبشير يمكن أن يصدر حكما بالسجن لمدة 10 سنوات. الحي التجاري بالدوحة.يعتبر شرب الكحول قانونيا جزئيا في قطر وفي بعض الفنادق الفاخرة من فئة الخمس نجوم مسموح لها ببيع الكحول لزبائنها غير المسلمين.[109][110] لا يسمح للمسلمين بشرب الكحول ويتعرض المسجونون لشربها للجلد أو الترحيل. يمكن للمقيمين غير المسلمين الحصول على تصريح لشراء الكحول للشرب الشخصي. يسمح لشركة قطر للتوزيع (وهي شركة تابعة للخطوط الجوية القطرية) باستيراد الكحول ولحم الخنزير وهي تقوم بتشغيل متجر واحد فقط لبيع الخمور في البلاد والتي تبيع أيضا لحم الخنزير لحاملي تراخيص الخمور.[111][112] كما أبدى المسؤولون القطريون استعدادهم للسماح للكحول في «مناطق المشجعين» في كأس العالم لكرة القدم 2022.[113] حتى عام 2011 سمح للمطاعم في لؤلؤة قطر (جزيرة من صنع الإنسان بالقرب من الدوحة) بتقديم المشروبات الكحولية. لكن في ديسمبر 2011 قيل لمطاعم لؤلؤة قطر أن تتوقف عن بيع الكحول.[109][114] لم يُقَدَّم أي تفسير للحظر على الرغم من أن التكهنات شملت تشجيع صورة أكثر وهمية قبل انتخابات كبيرة وشائعات عن نزاع مالي بين الحكومة ومطوري المنتجع. رُفِع حظر الكحول في وقت لاحق.[115] في عام 2014 أُطلِقَت حملة تواضع لتذكير السياح باللباس التقليدي للبلاد.[116] نصح السياح بعدم ارتداء الملابس الداخلية أو التنانير القصيرة أو الفساتين بدون أكمام أو الملابس القصيرة أو الضيقة في الأماكن العامة. حُذِّر الرجال من ارتداء السراويل القصيرة والملابس الداخلية فقط.[117] حقوق الإنسان المقالة الرئيسة: حقوق الإنسان في قطر تميم بن حمد بن خليفة آل ثاني أمير قطر منذ 2013م. العاصمة الدوحة ليلًا.وفقا لوزارة الخارجية الأمريكية فإن العمال المغتربين من الدول في جميع أنحاء آسيا وأجزاء من إفريقيا يهاجرون طوعا إلى قطر كعمال ذوي مهارات منخفضة أو خدم منازل ولكن بعضهم يواجه في وقت لاحق شروطا تدل على العبودية غير الطوعية. تشمل بعض الانتهاكات الأكثر شيوعا لحقوق العمال الضرب وحجب الدفع وتحصيل العمال على الاستحقاقات التي يتحملها صاحب العمل والقيود المفروضة على حرية التنقل (مثل مصادرة جوازات السفر ووثائق السفر وتصاريح الخروج) والاحتجاز التعسفي والتهديدات بالإجراءات القانونية والاعتداء الجنسي. دفع العديد من العمال الوافدين الذين يصلون إلى العمل في قطر رسومًا باهظة إلى شركات التوظيف في بلدانهم الأصلية.[118] اعتبارا من عام 2014 تنص بعض أحكام القانون الجنائي القطري على فرض عقوبات مثل الجلد والرجم كعقوبات جنائية. وجدت لجنة الأمم المتحدة لمناهضة التعذيب أن هذه الممارسات تشكل خرقًا للالتزامات التي تفرضها اتفاقية الأمم المتحدة لمناهضة التعذيب.[119][120] تحتفظ قطر بعقوبة الإعدام ولا سيما التهديدات الموجهة ضد الأمن القومي مثل الإرهاب. استخدام عقوبة الإعدام نادر الحدوث ولم تنفذ أي عمليات إعدام حكومية في قطر منذ عام 2003.[121] في قطر تعتبر الأعمال المثلية غير قانونية ويمكن معاقبتها بالإعدام.[122] بموجب أحكام قانون الكفالة في قطر يتمتع الرعاة بالسلطة من جانب واحد لإلغاء تصاريح إقامة العمال وحرمان العمال من تغيير أصحاب العمل والإبلاغ عن العامل بأنه «فار» لسلطات الشرطة ومنع الإذن بمغادرة البلاد. نتيجة لذلك قد تقيد الجهات الراعية تحركات العمال والعمال قد يخشون الإبلاغ عن الانتهاكات أو المطالبة بحقوقهم. وفقا لاتحاد النقابات الدولي يسمح نظام رعاية التأشيرات بتفريغ العمل الجبري من خلال جعله من الصعب على العامل المهاجر مغادرة صاحب عمل مسيء أو السفر إلى الخارج دون إذن.[123] كما أن قطر لا تحافظ على معايير الأجور لعمالها المهاجرين. كلفت قطر شركة المحاماة الدولية دلا بايبر بإعداد تقرير يحقق في نظام العمالة المهاجرة. في مايو 2014 أصدرت دلا بايبر أكثر من 60 توصية لإصلاح نظام الكفالة بما في ذلك إلغاء تأشيرات الخروج وإدخال الحد الأدنى للأجور التي تعهدت قطر بتنفيذها.[124] في مايو 2012 أعلن المسؤولون القطريون عزمهم على السماح بإنشاء نقابة مستقلة.[125] كما أعلنت قطر أنها ستلغي نظام الكفيل الخاص بالعمال الأجانب والذي يتطلب أن يكون جميع العمال الأجانب تحت رعاية أصحاب العمل المحليين. تشمل التغييرات الإضافية في قوانين العمل حكمًا يضمن دفع جميع رواتب العمال مباشرة إلى حساباتهم المصرفية والقيود الجديدة على العمل في الهواء الطلق في أهم الساعات خلال فصل الصيف.[126] أعلن مشروع قانون جديد أعلن في أوائل عام 2015 أن الشركات التي لا تدفع أجور العمال في الوقت المحدد قد تفقد مؤقتًا قدرتها على توظيف المزيد من الموظفين.[127] في أكتوبر 2015 وقع أمير قطر قانونا على إصلاحات جديدة لنظام الكفالة في البلاد مع دخول القانون الجديد حيز التنفيذ في غضون عام واحد.[128] يدعي النقاد أن التغييرات قد تفشل في معالجة بعض قضايا حقوق العمال.[129][130][131] منح البلد النساء في الوقت نفسه مع الرجال حق التصويت فيما يتعلق بانتخابات عام 1999 لمجلس البلديات المركزي.[87][132] كانت هذه الانتخابات - وهي الأولى من نوعها في قطر - قد عقدت عمدًا في 8 مارس 1999 الذي يصادف اليوم العالمي للمرأة. العلاقات الخارجية المقالة الرئيسة: علاقات قطر الخارجية الأمير السابق حمد بن خليفة آل ثاني ووزير الخارجية الأمريكي جون كيري في عام 2013. جلسة مؤتمر القمة الإسلامي في اسطنبول، تركيا. سفارة قطر في واشنطن العاصمة.الرئيس الأمريكي جو بايدن يرحب بالشيخ تميم بن حمد آل ثاني الاثنين 31 يناير 2022، في البيت الأبيض. علم قطر في ليبيا بعد الحرب الأهلية الليبية. لعبت قطر دورا مؤثرا خلال الربيع العربي. تسعى دولة قطر بوصفها بلدًا صغيرًا مع جيران أكبر إلى التأثير على النفوذ وحماية دولتها وسلالة حكمها.[133] يقدم تاريخ التحالفات القطرية نظرة ثاقبة على أساس سياستها. في الفترة ما بين عامي 1760 و 1971 سعت قطر إلى الحصول على حماية رسمية من دول قوية وهي العثمانيين والبريطانيين وآل خليفة من البحرين والعرب والوهابيين من المملكة العربية السعودية.[134] بالنسبة إلى بعض المحللين فإن دور قطر في الشؤون الدولية يمكن تحديده كقوة متوسطة. كانت قطر عضوا مبكرا في منظمة الدول المصدرة للنفط (أوبك) وعضوا مؤسسا في مجلس التعاون لدول الخليج العربية. قطر عضو في جامعة الدول العربية. لم يقبل البلد الولاية القضائية الإلزامية لمحكمة العدل الدولية. لدى قطر أيضًا علاقات ثنائية مع مجموعة متنوعة من القوى الأجنبية. تستضيف قطر قاعدة العديد الجوية وهي قاعدة أمريكية بريطانية مشتركة تعمل كمركز لجميع العمليات الجوية الأمريكية والبريطانية في الخليج العربي.[135] سمح للقوات الأمريكية والبريطانية باستخدام قاعدة جوية لإرسال الإمدادات إلى العراق وأفغانستان.[136] طبقا للوثائق المسربة التي نشرت في صحيفة نيويورك تايمز فإن سجل قطر في جهود مكافحة الإرهاب هو «الأسوأ في المنطقة». أشارت الوثيقة إلى أن جهاز الأمن في قطر «متردد في التصرف ضد الإرهابيين المعروفين بسبب قلقهم من الظهور على أنه يتماشى مع الولايات المتحدة ويثير أعمال انتقامية».لدى قطر علاقات مختلفة مع جيرانها في منطقة الخليج العربي. وقعت قطر اتفاقية دفاع مشتركة مع إيران،[137] والتي تتشارك معها أكبر حقل غاز في العالم. كانت قطر الدولة الثانية من بعد فرنسا التي تعترف علنا بالمجلس الوطني الانتقالي لقوات الثوار الليبيين كحكومة شرعية في ليبيا في خضم الحرب الأهلية الليبية عام 2011.[138] في عام 2014 وصلت علاقات قطر مع البحرين والمملكة العربية السعودية والإمارات العربية المتحدة إلى نقطة الغليان على دعم قطر لجماعة الإخوان المسلمين والجماعات المتطرفة في سوريا.[139] بلغت ذروتها الدول الثلاث المذكورة أعلاه بسحب سفراءها من قطر في مارس 2014.[140] في السنوات الأخيرة استخدمت قطر مقاتلين إسلاميين في عدد من البلدان منها مصر وسوريا وليبيا والصومال ومالي لتعزيز سياستها الخارجية. كان محاربة الإسلاميين من جماعة الإخوان المسلمين إلى الجماعات السلفية بمثابة مكبر للصوت للبلاد كما يعتقد منذ بداية الربيع العربي أن هذه المجموعات تمثل موجة المستقبل.[133][141][142] قال ديفيد كوهين وكيل وزارة الإرهاب والاستخبارات المالية في وزارة الخزانة الأمريكية أن قطر هي «سلطة تساهلية لتمويل الإرهاب».[143] هناك أدلة على أن هذه الجماعات التي تدعمها قطر تشمل الجماعات الإسلامية المتطرفة النشطة في شمال سوريا. اعتبارا من عام 2015 تدعم قطر والمملكة العربية السعودية وتركيا بشكل علني جيش الفتح[144][145] وهي مجموعة شاملة من القوات المناوئة للحكومة التي تقاتل في الحرب الأهلية السورية التي يقال إنها تضم جبهة النصرة المرتبطة بتنظيم القاعدة والتحالف السلفي المعروف باسم حركة أحرار الشام الإسلامية.[143][146] دعمت قطر الرئيس المنتخب ديمقراطيا محمد مرسي بدعم دبلوماسي وقناة الجزيرة المملوكة للدولة قبل أن يخلع في انقلاب عسكري.[147][148] عرضت قطر على مصر قرضا بقيمة 7.5 مليار دولار خلال العام الذي كان فيه في السلطة.[149] اتسمت مواقف قطر مع حركة حماس التي نشرت لأول مرة في مطلع عام 2012[150] بانتقادات من إسرائيل والولايات المتحدة ومصر والمملكة العربية السعودية «الذين يتهمون قطر بتقويض الاستقرار الإقليمي بدعم حماس».[151] من قطر نفت تأييد حماس وتصحيح ادعاءاتهم المزعومة قائلا: «نحن لا نؤيد حماس ولكننا نؤيد الفلسطينيين».[152] بعد اتفاق سلام تعهدت قطر بتقديم مليار دولار من المساعدات الإنسانية إلى غزة.[153] استضافت قطر المؤتمرات الأكاديمية والدينية والسياسية والاقتصادية. حضر منتدى الدوحة السنوي الحادي عشر مؤخرا المفكرين الرئيسيين والمهنيين من مختلف الخلفيات والشخصيات السياسية من جميع أنحاء العالم لمناقشة قضايا الديمقراطية والإعلام وتكنولوجيا المعلومات والتجارة الحرة والأمن المائي. بالإضافة إلى ذلك شارك المنتدى في مؤتمر المستقبل الاقتصادي في الشرق الأوسط منذ عام 2006.[154] في الآونة الأخيرة استضافت قطر محادثات السلام بين الفصائل المتنافسة في جميع أنحاء العالم. من أبرزها اتفاق دارفور. إن إعلان الدوحة هو أساس عملية السلام في دارفور وقد حقق مكاسب كبيرة على أرض الواقع في المنطقة الأفريقية. شملت الإنجازات البارزة استعادة الأمن والاستقرار والتقدم المحرز في عمليات التشييد وإعادة الإعمار وعودة السكان المشردين وتوحيد شعب دارفور لمواجهة التحديات ودفع عملية السلام قدما.[155] تبرعت قطر بمبلغ 88.5 مليون جنيه استرليني لتمويل عمليات الإنعاش وإعادة الإعمار في دارفور.[156] في يونيو 2017 قطعت السعودية والإمارات والبحرين ومصر واليمن علاقاتها الدبلوماسية مع قطر متهمة قطر بدعم الإرهاب،[157] وتصعيد الخلاف حول دعم قطر للإخوان المسلمين الذي يعتبر منظمة إرهابية من قبل تلك الدول العربية الخمس. أوضحت المملكة العربية السعودية أن هذه الخطوة ستكون تدبيرا ضروريا لحماية أمن المملكة. كما أزيلت القوات القطرية من التحالف العسكري في اليمن. أغلقت مصر مجالها الجوي والموانئ على جميع وسائل النقل القطرية.[158][159]الجيش المقالة الرئيسة: القوات المسلحة القطريةطائرة داسو ميراج 2000 قطرية تحلق فوق ليبيا.  مركز العمليات الجوية المشتركة الأمريكية في قاعدة العديد الجوية في قطر. القوات المسلحة القطرية هي القوات العسكرية في قطر. تحتفظ البلاد بقوة عسكرية متواضعة قوامها حوالي 11800 رجل من بينهم 8500 للقوات البرية و 1800 للقوة البحرية و 1500 للقوة الجوية. شكلت نفقات الدفاع في قطر حوالي 4.2٪ من الناتج القومي الإجمالي في عام 1993 و 1.5٪ من الناتج المحلي الإجمالي في عام 2010 وهو آخر عام متاح في قاعدة بيانات سيبري الإحصائية.[160] وقعت قطر مؤخرا اتفاقيات دفاع مشترك مع الولايات المتحدة والمملكة المتحدة وكذلك مع فرنسا في وقت سابق من عام 1994. تلعب قطر دورا نشطا في جهود الدفاع الجماعي لمجلس التعاون الخليجي مع الدول الخمس الأخرى وهي السعودية والكويت والبحرين والإمارات وسلطنة عمان. إن وجود قاعدة العديد الجوية الكبيرة التي تديرها الولايات المتحدة وعدة دول أخرى في الأمم المتحدة يوفر مصدرا مضمونا للدفاع والأمن القومي. في عام 2008 أنفقت قطر 2.355 مليار دولار على النفقات العسكرية و 2.3٪ من الناتج المحلي الإجمالي.[161] تم تدريب القوات الخاصة القطرية من قبل فرنسا ودول غربية أخرى ويعتقد أنها تمتلك مهارة كبيرة.[162] كما ساعدوا المتمردين الليبيين خلال معركة تحرير طرابلس (2011). وجد معهد ستوكهولم الدولي لأبحاث السلام (سيبري) أن قطر كانت في عام 2010 - صاحب المركز الرابع عشر لأكبر مستورد للأسلحة في العالم. ومع ذلك كتب سيبري بأن خطط قطر لتحويل وتوسيع قواتها المسلحة بشكل كبير تسارعت. في عام 2014 تم توقيع عدة عقود من أجل شراء 62 دبابة و 24 بندقية ذاتية الدفع من ألمانيا وشراء 24 طائرة هليكوبتر قتالية و 3 طائرات للإنذار المبكر والتحكم من الولايات المتحدة وطائرتين صهاريجتين من إسبانيا.[163] في عام 2015 كانت قطر صاحب المركز السادس عشر لأكبر مستورد للأسلحة في العالم وفي عام 2016 كانت في المرتبة الحادية عشر وفقا لسيبري.[164] شارك الجيش القطري في التدخل بقيادة السعودية في اليمن ضد الشيعة الحوثيين. في عام 2015 ذكرت «الجزيرة أمريكا»: «تشير تقارير عديدة إلى أن التحالف الذي تقوده السعودية ضد جماعات المعارضة في اليمن هاجم المدنيين بشكل عشوائي واستخدم قنابل عنقودية في مناطق مأهولة بالسكان المدنيين مما يشكل انتهاكا للقانون الدولي».[165] قتل العديد من المدنيين وتدمرت الآن أجزاء كبيرة من البنية التحتية في هذه المنطقة.[166] تعرضت المستشفيات للقصف من قبل السعوديين والذين يعملون معهم.[167][168] الجغرافيا المقالة الرئيسة: جغرافيا قطر الساحل الصحراوي  المشهد الصحراوي في قطر  الدوحة عاصمة قطر. تبرز شبه الجزيرة القطرية 160 كيلومتر (100 ميل) في الخليج العربي شمال المملكة العربية السعودية. تقع بين خطي العرض 24° و27° شمالا وخط الطول 50° و52° شرقا. تتكون معظم البلاد من سهول جرداء منخفضة مغطاة بالرمال. إلى الجنوب الشرقي يقع خور العديد («بحر داخلي») وهي منطقة من الكثبان الرملية المتداولة المحيطة بمدخل الخليج العربي. هناك الطقس معتدل في الشتاء وحار جدا ورطب في الصيف.  أعلى نقطة في قطر هي قرين أبو البول على ارتفاع 103 أمتار (338 قدم)[169] في جبل دخان من الغرب وهي مجموعة من الانحدارات المنخفضة من الحجر الجيري التي تمتد من الشمال إلى الجنوب من زيكريت عبر أم باب إلى الحدود الجنوبية. كما تحتوي منطقة جبل دخان على الرواسب الرئيسية لحقول النفط في قطر في حين تقع حقول الغاز الطبيعي في عرض البحر إلى الشمال الغربي من شبه الجزيرة. التنوع البيولوجي والبيئة المقالة الرئيسة: الحياة البرية في قطر المها العربي الحيوان الوطني في قطر  النعامات في قطر وقعت قطر على اتفاقية ريو للتنوع البيولوجي في 11 يونيو 1992 وأصبحت طرفا في الاتفاقية في 21 أغسطس 1996.[170] أعدت بعد ذلك إستراتيجية وخطة عمل وطنيتين للتنوع البيولوجي تلقتها الاتفاقية في 18 مايو 2005.[171] تم تسجيل 142 نوعًا فطريًا في قطر.[172] يوثق كتاب أصدرته مؤخرًا وزارة البيئة السحالي المعروفة أو التي يعتقد أنها وجدت في قطر استنادا إلى الدراسات الاستقصائية التي أجراها فريق دولي من العلماء وغيرهم من المتعاونين.[173] على مدى عقدين من الزمن حققت قطر أعلى انبعاثات للفرد من ثاني أكسيد الكربون في العالم حيث بلغت 49.1 طن متري للشخص الواحد في عام 2008.[174] يعتبر القطريون أيضا من أعلى مستهلكي المياه للفرد الواحد يوميا حيث يستخدمون حوالي 400 لتر.[175] في عام 2008 أطلقت قطر رؤيتها الوطنية 2030 التي تسلط الضوء على التنمية البيئية باعتبارها أحد الأهداف الرئيسية الأربعة لدولة قطر على مدى العقدين القادمين. تتعهد الرؤية الوطنية بتطوير بدائل مستدامة للطاقة القائمة على النفط للحفاظ على البيئة المحلية والعالمية.[176]  المناخ البيانات المناخية لـقطر الشهر	يناير	فبراير	مارس	أبريل	مايو	يونيو	يوليو	أغسطس	سبتمبر	أكتوبر	نوفمبر	ديسمبر	المعدل السنوي متوسط درجة الحرارة الكبرى °م (°ف)	22";
        let data = load_from_file("tokenizer");
        data._decode(data._encode(str.to_owned()));
    }
}

#[pymodule]
fn arabic_tokenizer(_py: Python, m: &PyModule) -> PyResult<()> {
    m.add_class::<Data>()?;
    m.add_function(wrap_pyfunction!(load_from_file, m)?)?;
    Ok(())
}
